In [15]:
%pip install openpyxl

Requirement already satisfied: openpyxl in /home/zeeshan/miniconda3/envs/ml_env/lib/python3.12/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /home/zeeshan/miniconda3/envs/ml_env/lib/python3.12/site-packages (from openpyxl) (1.1.0)

In [20]:
import pandas as pd
import seaborn as sns
# load data set 
kashti = sns.load_dataset("titanic")
# write a file 
kashti.to_excel("datasets/titanic.xlsx")

In [3]:
# how to read a file
import pandas as pd
df = pd.read_excel("datasets/titanic.xlsx")
df.info() # get info about data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   891 non-null    int64
 1   survived     891 non-null    int64
 2   pclass       891 non-null    int64
 3   sex          891 non-null    object
 4   age          714 non-null    float64
 5   sibsp        891 non-null    int64
 6   parch        891 non-null    int64
 7   fare         891 non-null    float64
 8   embarked     889 non-null    object
 9   class        891 non-null    object
 10  who          891 non-null    object
 11  adult_male   891 non-null    bool
 12  deck         203 non-null    object
 13  embark_town  889 non-null    object
 14  alive        891 non-null    object
 15  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(5), object(7)
memory usage: 99.3+ KB

In [31]:
df.head() # get top 5 records from data

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
# practice for https://pandas.pydata.org/docs/user_guide/10min.html
import numpy as np
values = np.random.randn(6, 5)
dates = pd.date_range(start="20130101",periods=6)

# Creating a DataFrame by passing a NumPy array with a datetime index using date_range() and labeled columns:
df = pd.DataFrame(data=values, index=dates, columns=list("ABCDE"))
df

                   A         B         C         D         E
2013-01-01 -0.838856 -0.043928 -1.537271  0.142917  0.694419
2013-01-02 -0.175787  1.168044  0.578714 -0.987062  2.036749
2013-01-03  0.229681  1.725975  0.542906 -1.748658  0.979002
2013-01-04  1.887829 -0.415917  0.728362  0.484537 -2.330408
2013-01-05  0.220473 -0.144303 -0.179282 -0.844392  1.646242
2013-01-06 -0.660672 -2.695545  1.722937 -0.750822 -2.877087

#### creatign the DataFrame by passing a dictionary of objects where the keys are the column labels and the value are the column values

In [6]:
df2 = pd.DataFrame(
    {
        "A":1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2.info()
df2.dtypes

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[s]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[s](1), float32(1), float64(1), int32(1), object(1)
memory usage: 288.0+ bytes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

#### Viewing data

In [7]:
df2.head(3) # fetch 2 result from the top of dtaframe

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo

In [51]:
df.tail(3) # fetch 3 records from bottom

                   A         B         C         D         E
2013-01-04 -0.185495  0.877542 -1.215900 -0.614657 -1.649769
2013-01-05  0.234804  1.390588  0.993869  1.712205  0.184397
2013-01-06  0.257352 -0.496829  1.167648 -0.176117  0.924259

#### Display the index , and column

In [9]:
df.index
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

##### Return a NumPy representation of the underlying data with DataFrame.to_numpy() without the index or column labels:

In [57]:
df.to_numpy()

array([[ 0.87514337, -0.84434064, -0.15301088,  0.84690366, -0.28958212],
       [ 0.49280061,  1.13205477,  0.81007573, -0.66543518,  1.65666756],
       [-0.41209097,  1.19566304, -0.21494601, -0.92403331, -0.69186173],
       [-0.18549527,  0.87754246, -1.21589976, -0.61465721, -1.64976949],
       [ 0.23480427,  1.39058809,  0.99386925,  1.71220507,  0.18439662],
       [ 0.25735241, -0.49682853,  1.16764823, -0.17611747,  0.92425891]])

##### NumPy arrays have one dtype for the entire array while pandas DataFrames have one dtype per column. When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. If the common data type is object, DataFrame.to_numpy() will require copying data.

In [58]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [59]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [67]:
df.head()

                   A         B         C         D         E
2013-01-01  0.875143 -0.844341 -0.153011  0.846904 -0.289582
2013-01-02  0.492801  1.132055  0.810076 -0.665435  1.656668
2013-01-03 -0.412091  1.195663 -0.214946 -0.924033 -0.691862
2013-01-04 -0.185495  0.877542 -1.215900 -0.614657 -1.649769
2013-01-05  0.234804  1.390588  0.993869  1.712205  0.184397

### describe() shows a quick statistic summary of your data:

In [15]:
df.describe()

              A         B         C         D         E
count  6.000000  6.000000  6.000000  6.000000  6.000000
mean   0.110445 -0.067612  0.309394 -0.617247  0.024819
std    0.976027  1.534770  1.090842  0.809700  2.097802
min   -0.838856 -2.695545 -1.537271 -1.748658 -2.877087
25%   -0.539451 -0.348013  0.001265 -0.951394 -1.574202
50%    0.022343 -0.094116  0.560810 -0.797607  0.836710
75%    0.227379  0.865051  0.690950 -0.080518  1.479432
max    1.887829  1.725975  1.722937  0.484537  2.036749

### Transposing your data:

In [65]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.875143    0.492801   -0.412091   -0.185495    0.234804    0.257352
B   -0.844341    1.132055    1.195663    0.877542    1.390588   -0.496829
C   -0.153011    0.810076   -0.214946   -1.215900    0.993869    1.167648
D    0.846904   -0.665435   -0.924033   -0.614657    1.712205   -0.176117
E   -0.289582    1.656668   -0.691862   -1.649769    0.184397    0.924259

### Sort Index

In [17]:
df.sort_index(axis=1, ascending=False)

                   E         D         C         B         A
2013-01-01  0.694419  0.142917 -1.537271 -0.043928 -0.838856
2013-01-02  2.036749 -0.987062  0.578714  1.168044 -0.175787
2013-01-03  0.979002 -1.748658  0.542906  1.725975  0.229681
2013-01-04 -2.330408  0.484537  0.728362 -0.415917  1.887829
2013-01-05  1.646242 -0.844392 -0.179282 -0.144303  0.220473
2013-01-06 -2.877087 -0.750822  1.722937 -2.695545 -0.660672

## Selection
### 1) Getitem ([])
#### For a DataFrame, passing a single label selects a columns and yields a Series equivalent to df.A:

In [76]:
df["A"]

2013-01-01    0.875143
2013-01-02    0.492801
2013-01-03   -0.412091
2013-01-04   -0.185495
2013-01-05    0.234804
2013-01-06    0.257352
Freq: D, Name: A, dtype: float64

In [20]:
df.A

2013-01-01   -0.838856
2013-01-02   -0.175787
2013-01-03    0.229681
2013-01-04    1.887829
2013-01-05    0.220473
2013-01-06   -0.660672
Freq: D, Name: A, dtype: float64

#### For a DataFrame, passing a slice : selects matching rows

In [77]:
df[0:3]

                   A         B         C         D         E
2013-01-01  0.875143 -0.844341 -0.153011  0.846904 -0.289582
2013-01-02  0.492801  1.132055  0.810076 -0.665435  1.656668
2013-01-03 -0.412091  1.195663 -0.214946 -0.924033 -0.691862

In [78]:
df["20130102":"20130104"]

                   A         B         C         D         E
2013-01-02  0.492801  1.132055  0.810076 -0.665435  1.656668
2013-01-03 -0.412091  1.195663 -0.214946 -0.924033 -0.691862
2013-01-04 -0.185495  0.877542 -1.215900 -0.614657 -1.649769

### 2) Selection by label
#### Selecting a row matching a label:

In [23]:
df

                   A         B         C         D         E
2013-01-01 -0.838856 -0.043928 -1.537271  0.142917  0.694419
2013-01-02 -0.175787  1.168044  0.578714 -0.987062  2.036749
2013-01-03  0.229681  1.725975  0.542906 -1.748658  0.979002
2013-01-04  1.887829 -0.415917  0.728362  0.484537 -2.330408
2013-01-05  0.220473 -0.144303 -0.179282 -0.844392  1.646242
2013-01-06 -0.660672 -2.695545  1.722937 -0.750822 -2.877087

In [22]:
df.loc[dates[0]]

A   -0.838856
B   -0.043928
C   -1.537271
D    0.142917
E    0.694419
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
# we can iterate in descending order too.
df.loc[dates[-6]]

A   -0.838856
B   -0.043928
C   -1.537271
D    0.142917
E    0.694419
Name: 2013-01-01 00:00:00, dtype: float64

##### Selecting a single row and column label returns a scalar:

In [38]:
df.loc[dates[0],"A"]

-0.8388560879987071

##### For getting fast access to a scalar (equivalent to the prior method):

In [42]:
df.at[dates[0],"A]

TypeError: DataFrame._get_value() got multiple values for argument 'takeable'

#### Selecting all rows (:) with a select column labels:

In [34]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.838856 -0.043928
2013-01-02 -0.175787  1.168044
2013-01-03  0.229681  1.725975
2013-01-04  1.887829 -0.415917
2013-01-05  0.220473 -0.144303
2013-01-06 -0.660672 -2.695545

#### For label slicing, both endpoints are included:

In [36]:
df.loc["20130102":"20130104", ["A","B"]]

                   A         B
2013-01-02 -0.175787  1.168044
2013-01-03  0.229681  1.725975
2013-01-04  1.887829 -0.415917